bdintu/Minesweeper/STM32/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include "et_stm32f_arm_kit_lcd.h"
#include <string.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi3;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define White 0xFFFF
#define Black 0x0000
#define Grey 0xF7DE
#define Grey2 0x8410
#define Grey3 0xCE79
#define Blue 0x001F
#define Blue2 0x051F
#define Blue3 0x041F
#define Blue4 0x07DFF
#define Red 0xF800
#define Magenta 0xF81F
#define Green 0x07E0
#define Green2 0x87F0
#define Cyan 0x7FFF
#define Yellow 0xFFE0
#define Yellow2 0xFFF0
#define Pink2 0xF810
#define Pink 0xFD5A
#define Purple 0xFC1F
#define Purple2 0xF81F
#define Orange 0xFC64
#define Orange2 0xFD62

//  void LCD_DrawFullFrame(uint8_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI3_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint32_t count;
uint16_t posX, posY;
char pos[50];
int x=0;
int y=1;
void DrawBomb(int Xpos,int Ypos);
void DrawKite(int Xpos,int Ypos);
void Draw0(int Xpos,int Ypos);
void Draw1(int Xpos,int Ypos);
void Draw2(int Xpos,int Ypos);
void Draw3(int Xpos,int Ypos);
void Draw4(int Xpos,int Ypos);
void Draw5(int Xpos,int Ypos);
void Draw6(int Xpos,int Ypos);
void Draw7(int Xpos,int Ypos);
void Draw8(int Xpos,int Ypos);
void Draw9(int Xpos,int Ypos);
void DrawFlag(int Xpos,int Ypos);
void Menu();
//void DrawX(int Xpos,int Ypos,uint16_t color);
//void DrawShip(int Xpos,int Ypos,int numShip);
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI3_Init();
  MX_USART2_UART_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();

  /* USER CODE BEGIN 2 */

LCD_Setup();
//LCD_Clear(Blue2);
LCD_SetBackColor(Blue);
LCD_SetTextColor(Yellow);
//HAL_TIM_Base_Start_IT (&htim1);








  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

	if((HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_8) == GPIO_PIN_RESET)&&(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_9) == GPIO_PIN_RESET)) //State 0
	{  int ToDo=0;
		//Menu();
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_10)==GPIO_PIN_SET)
			ToDo+=1;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_11)==GPIO_PIN_SET)
			ToDo+=2;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_12)==GPIO_PIN_SET)
			ToDo+=4;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_13)==GPIO_PIN_SET)
			ToDo+=8;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_14)==GPIO_PIN_SET)
			ToDo+=16;
		
	

		if(ToDo==1)
    {
		LCD_Clear(White); 
			/*
		char ch[13] =  " MINESWEEPER " ;
		for (int j=0;j<13;j++)
		{LCD_SetBackColor(White);
      LCD_SetTextColor(Red);
			LCD_DisplayChar(Line3,16*(4+j),ch[12-j]);}
		char ch2[13] = "  -- GAME -- ";
		for (int j=0;j<13;j++)
			{LCD_SetBackColor(White);
      LCD_SetTextColor(Red);
			LCD_DisplayChar(Line4,16*(4+j),ch2[12-j]);}
			*/
			LCD_SetBackColor(Red);
      LCD_SetTextColor(Red);
			Menu();
			while(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_10)==1)
			{}

