bdintu/Minesweeper/STM32/Src/main.c
		}
		if(ToDo==2)
    {
			LCD_Clear(Blue2);
		char ch[13] =  " Select mode " ;
		for (int j=0;j<13;j++)
		{LCD_SetBackColor(White);
      LCD_SetTextColor(Red);
			LCD_DisplayChar(Line3,16*(4+j),ch[12-j]);}
		char ch2[13] = " Easy - Left ";
		for (int j=0;j<13;j++)
			{LCD_SetBackColor(Yellow);
      LCD_SetTextColor(Black);
			LCD_DisplayChar(Line5,16*(4+j),ch2[12-j]);}
    char ch3[13] = " Medium - Up ";
		for (int j=0;j<13;j++)
			{LCD_SetBackColor(Green2);
      LCD_SetTextColor(Black);
			LCD_DisplayChar(Line6,16*(4+j),ch3[12-j]);}
    char ch4[13] = " Hard - Down ";
		for (int j=0;j<13;j++)
			{LCD_SetBackColor(Red);
      LCD_SetTextColor(White);
			LCD_DisplayChar(Line7,16*(4+j),ch4[12-j]);}
			
		while(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_9)==0&&HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_10)==0)
			{}
		if (HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_9)==1&&HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_8)==0)
		{LCD_Clear(Blue2);
		 for (int i = 0; i<6; i++)
		 {
			for (int j=1; j<7; j++)
			{
				//if((i+j)%2 ==0){

				LCD_SetBackColor(Grey);
				LCD_SetTextColor(Grey2);
				LCD_DrawFullRect(i*40, j*40, 40, 40);
				LCD_SetBackColor(Grey2);
			  LCD_SetTextColor(Grey2);
		  	LCD_DrawFullFrame(i*40+1,j*40-1,38,38);
				LCD_SetBackColor(Grey);
				LCD_SetTextColor(Grey2);
				LCD_DrawFullRect(i*40+6, j*40-6, 28, 28);
			}
		 }
	  }
	 }
	}
	
	if((HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_8) == GPIO_PIN_RESET)&&(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_9) == GPIO_PIN_SET))
	{

		int x=0,y=0,ToDo=0;

		//                   get x,y,ToDo
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_8)==GPIO_PIN_SET)
			x+=1;
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_9)==GPIO_PIN_SET)
			x+=2;
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_10)==GPIO_PIN_SET)
			x+=4;
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_11)==GPIO_PIN_SET)
			y+=1;
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_12)==GPIO_PIN_SET)
			y+=2;
		if(HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_13)==GPIO_PIN_SET)
			y+=4;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_10)==GPIO_PIN_SET)
			ToDo+=1;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_11)==GPIO_PIN_SET)
			ToDo+=2;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_12)==GPIO_PIN_SET)
			ToDo+=4;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_13)==GPIO_PIN_SET)
			ToDo+=8;
		if(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_14)==GPIO_PIN_SET)
			ToDo+=16;
		
		int temp =0;
		temp = x ;
		x = y ;
		y = 5-temp + 1;
		// test
		/*
		ToDo = 14;
		x=0;
		y=2;
		*/
		
		//										play
		if(ToDo==0)
		{
			/*
		//DrawTable();			
		for (int i = 0; i<6; i++)
		{
			for (int j=1; j<7; j++)
			{
				//if((i+j)%2 ==0){
				LCD_SetBackColor(Grey);
				LCD_SetTextColor(Grey2);
				LCD_DrawFullRect(i*40, j*40, 40, 40);
				LCD_SetBackColor(Grey2);
			  LCD_SetTextColor(Grey2);
		  	LCD_DrawFullFrame(i*40+1,j*40-1,38,38);
			}
		}
			*/
	 }
		else if(ToDo==1)
		{
			//DrawSpace
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);


		}
		else if(ToDo==2)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw0(x, y);
		}
		else if(ToDo==3)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw1(x, y);
		}
		else if(ToDo==4)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw2(x, y);
		}
		else if(ToDo==5)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw3(x, y);
		}
		else if(ToDo==6)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw4(x, y);
		}
		else if(ToDo==7)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw5(x, y);
		}
		else if(ToDo==8)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw6(x, y);
		}
		else if(ToDo==9)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw7(x, y);
		}
		else if(ToDo==10)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw8(x, y);
		}
		else if(ToDo==11)
		{
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40+4, y*40-4, 32, 32);
			Draw9(x, y);
		}
		
		else if(ToDo==12)
		{
			//Draw target
			LCD_SetBackColor(Red);
			LCD_SetTextColor(Red);
			LCD_DrawFullFrame(x*40+1,y*40-1,38,38);

		}
		else if(ToDo==13)
		{
			//delete target
			LCD_SetBackColor(Grey2);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullFrame(x*40+1,y*40-1,38,38);
		}
		else if(ToDo==14)
		{
			// Flag
			DrawFlag(x*40, y*40);

		}
		else if(ToDo==15)
		{
			//Draw Bomb
			LCD_SetBackColor(Grey3);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40, y*40, 40, 40);
			DrawBomb(x,y);
		}
		else if(ToDo==16)
		{
			//drawBomb red
			LCD_SetBackColor(Red);
			LCD_SetTextColor(Grey2);
			LCD_DrawFullRect(x*40, y*40, 40, 40);
			DrawBomb(x,y);
		}

	}
	if((HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_8) == GPIO_PIN_SET)&&(HAL_GPIO_ReadPin(GPIOE,GPIO_PIN_9) == GPIO_PIN_RESET))
	{
		LCD_DisplayStringLine(Line1," End Game baby");
	}    
  /*char str[20];
	sprintf(str,"\r%02d",input);
	LCD_SetBackColor(White);
	LCD_SetTextColor(Black);
  LCD_DisplayStringLine(Line4,str);
  HAL_Delay(50);*/

   
	
	

	/*	
  char str[20];
	uint32_t b;
	b = (count/60)%60;
	sprintf(str,"\r%02u:",b);
	HAL_UART_Transmit(&huart2, (uint8_t*) str, strlen(str),100);
	
  char strr[20]	;
	b = (count)%60;	 
	sprintf(strr,"%02u ",b);
	HAL_UART_Transmit(&huart2, (uint8_t*) strr,strlen(strr),100);
		

  LCD_DisplayStringLine(Line4,(char*) strcat(str,strr));
	*/


  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV4;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.Prediv1Source = RCC_PREDIV1_SOURCE_PLL2;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL6_5;
  RCC_OscInitStruct.PLL2.PLL2State = RCC_PLL2_ON;
  RCC_OscInitStruct.PLL2.PLL2MUL = RCC_PLL2_MUL8;
  RCC_OscInitStruct.PLL2.HSEPrediv2Value = RCC_HSE_PREDIV2_DIV5;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

