bdintu/Minesweeper/STM32/Src/main.c
}

/* USER CODE BEGIN 4 */
void DrawBomb(int x,int y)
{
	    int xb=(x*40)+5;
			int yb=(y*40)-5;
	

      LCD_SetBackColor(Black);
			LCD_SetTextColor(Black);
			LCD_DrawFullCircle((x+1)*40-20,y*40-20,10);
	
      LCD_SetBackColor(Black);
			LCD_SetTextColor(Black);
			LCD_DrawFullRect(xb+1, yb-13, 4, 4);
	    LCD_DrawFullRect(xb+13,yb-1 , 4, 4);
	    LCD_DrawFullRect(xb+25,yb-13, 4, 4);
		  LCD_DrawFullRect(xb+13, yb-26, 4, 4);
	
      DrawKite(xb+7, yb-23);
	    DrawKite(xb+7, yb-7);
	    DrawKite(xb+22, yb-23);
	    DrawKite(xb+22, yb-7);

	
	    LCD_SetBackColor(White);
			LCD_SetTextColor(Black);
			LCD_DrawFullCircle((x+1)*40-24,y*40-16,2);
	
}


void DrawKite(int x,int y)
{
	    LCD_SetBackColor(Black);
			LCD_SetTextColor(Black);
			LCD_DrawFullRect(x, y+1, 1, 1);
	    LCD_DrawFullRect(x, y+2, 1, 1);
	    LCD_DrawFullRect(x, y-1, 1, 1);
	    LCD_DrawFullRect(x, y-2, 1, 1);
	    LCD_DrawFullRect(x+1, y, 1, 1);
	    LCD_DrawFullRect(x+2, y, 1, 1);
	    LCD_DrawFullRect(x-1, y, 1, 1);
	    LCD_DrawFullRect(x-2, y, 1, 1);
	    LCD_DrawFullRect(x+1, y+1, 1, 1);
	    LCD_DrawFullRect(x+1, y-1, 1, 1);
	    LCD_DrawFullRect(x-1, y+1, 1, 1);
	    LCD_DrawFullRect(x-1, y-1, 1, 1);
}

void Draw0(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;
	    LCD_SetBackColor(Pink);
			LCD_SetTextColor(Pink);
			LCD_DrawFullRect(xb+1, yb-7, 18, 4);
			LCD_DrawFullRect(xb+26, yb-7, 18, 4);
			LCD_DrawFullRect(xb+1, yb-7, 4, 24);
			LCD_DrawFullRect(xb+1, yb-21, 4, 24);
}
void Draw1(int x,int y)
{
	    int xb=(x*40)+5;
			int yb=(y*40)-5;
		  LCD_SetBackColor(Blue3);
			LCD_SetTextColor(Blue3);
			LCD_DrawFullRect(	xb+4,yb-8,9,4);
			LCD_DrawFullRect(xb+8,yb-13,4,15);
			LCD_DrawFullRect(xb+23, yb-8, 14, 4);

}
void Draw2(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;
	    LCD_SetBackColor(Green);
			LCD_SetTextColor(Green);
			LCD_DrawFullRect(xb+4, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-19, 4, 13);
			LCD_DrawFullRect(xb+13, yb-7, 16, 4);
			LCD_DrawFullRect(xb+13, yb-7, 4, 13);
	    LCD_DrawFullRect(xb+22, yb-7, 16, 4);
	    
}
void Draw3(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;	
	    LCD_SetBackColor(Red);
			LCD_SetTextColor(Red);
	    LCD_DrawFullRect(xb+4, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-19, 4, 22);
			LCD_DrawFullRect(xb+13, yb-7, 16, 4);
			LCD_DrawFullRect(xb+22, yb-7, 16, 4);

}
void Draw4(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;
		  LCD_SetBackColor(Blue);
			LCD_SetTextColor(Blue);
			LCD_DrawFullRect(xb+4, yb-7, 4, 14);
			LCD_DrawFullRect(xb+4, yb-16, 4, 24);
			LCD_DrawFullRect(xb+14, yb-7, 16, 4);

}
void Draw5(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;
		  LCD_SetBackColor(Magenta);
			LCD_SetTextColor(Magenta);
			LCD_DrawFullRect(xb+4, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-7, 4, 13);
			LCD_DrawFullRect(xb+13, yb-7, 16, 4);
			LCD_DrawFullRect(xb+13, yb-19, 4, 13);
	    LCD_DrawFullRect(xb+22, yb-7, 16, 4);	
}
void Draw6(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;	    
			LCD_SetBackColor(Cyan);
			LCD_SetTextColor(Cyan);
			LCD_DrawFullRect(xb+4, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-7, 4, 22);
			LCD_DrawFullRect(xb+13, yb-7, 16, 4);
			LCD_DrawFullRect(xb+13, yb-19, 4, 13);
	    LCD_DrawFullRect(xb+22, yb-7, 16, 4);
}
void Draw7(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;	   
			LCD_SetBackColor(Purple);
			LCD_SetTextColor(Purple);
			LCD_DrawFullRect(xb+4, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-19, 4, 23);

}
void Draw8(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;
			LCD_SetBackColor(Grey2);
			LCD_SetTextColor(Grey2);	
			LCD_DrawFullRect(xb+4, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-7, 4, 22);
			LCD_DrawFullRect(xb+13, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-19, 4, 22);
	    LCD_DrawFullRect(xb+22, yb-7, 16, 4);	
}

void Draw9(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;	 
			LCD_SetBackColor(Orange);
			LCD_SetTextColor(Orange);		
			LCD_DrawFullRect(xb+4, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-7, 4, 13);
			LCD_DrawFullRect(xb+13, yb-7, 16, 4);
			LCD_DrawFullRect(xb+4, yb-19, 4, 22);
	    LCD_DrawFullRect(xb+22, yb-7, 16, 4);	 
}

void DrawFlag(int x,int y)
{
		  int xb=(x*40)+5;
			int yb=(y*40)-5;	
	
      LCD_SetBackColor(Black);
	    LCD_SetTextColor(Black);
			LCD_DrawFullRect(xb+28, yb-6, 20, 2);
    	LCD_DrawFullRect(xb+26, yb-11, 14, 2);
	    LCD_DrawFullRect(xb+20, yb-19, 2, 5);
	
    	LCD_SetBackColor(Red);
	    LCD_SetTextColor(Red);
	    LCD_DrawFullRect(xb+3, yb-16, 6, 17);
	    LCD_DrawFullRect(xb+5, yb-13, 3, 13);
	    LCD_DrawFullRect(xb+8, yb-8, 5, 8);
	    LCD_DrawFullRect(xb+10, yb-5, 3, 4);

}

void Menu()
{ int x=30,y=310-20;
	//M
  LCD_DrawFullRect(x+10, y-10, 10, 50);
	int i = 0,j=0;
	while (10+i<=40&&20+j<=50)
	{
		LCD_SetBackColor(Red);
	  LCD_SetTextColor(Red);
	  LCD_DrawFullRect(x+10+i, y-10-j, 10,10);
		i++;
		j++;
	}
	i=0;
	j=0;
	while (x+50-i!=x+10&&y-40-j!=y-70)
	{
	LCD_DrawFullRect(x+40-i, y-40-j, 10, 10);
		i++;
		j++;
	}
	LCD_DrawFullRect(x+10, y-70, 10, 50);
	
	//I
	LCD_DrawFullRect(x+10, y-100, 30, 10);
	LCD_DrawFullRect(x+10, y-110, 10, 40);
	LCD_DrawFullRect(x+50, y-100, 30, 10);
	//N
	LCD_DrawFullRect(x+10, y-150, 10, 50);
	LCD_DrawFullRect(x+10, y-160, 10, 20);
	LCD_DrawFullRect(x+20, y-170, 10, 30);
	LCD_DrawFullRect(x+40, y-180, 10, 20);
	LCD_DrawFullRect(x+10, y-190, 10, 50);
	//E
	LCD_DrawFullRect(x+10, y-220, 40, 10);
	LCD_DrawFullRect(x+10, y-220, 10, 50);
	LCD_DrawFullRect(x+30, y-220, 30, 10);
	LCD_DrawFullRect(x+50, y-220, 40, 10);
	
	
	y=310;
	//s
	LCD_DrawFullRect(x+70, y-10, 30, 10);
	LCD_DrawFullRect(x+70, y-10, 10, 30);
	LCD_DrawFullRect(x+90, y-10, 30, 10);
	LCD_DrawFullRect(x+90, y-30, 10, 40);
	LCD_DrawFullRect(x+120, y-10, 30, 10);
	
	//w
	LCD_DrawFullRect(x+70, y-50, 10, 60);
	LCD_DrawFullRect(x+120, y-50, 50, 10);
	LCD_DrawFullRect(x+100, y-70, 10, 30);
	LCD_DrawFullRect(x+70, y-90, 10, 60);
	
	//e
	LCD_DrawFullRect(x+70, y-110, 30, 10);
	LCD_DrawFullRect(x+70, y-110, 10, 60);
	LCD_DrawFullRect(x+90, y-110, 20, 10);
	LCD_DrawFullRect(x+120, y-110, 30, 10);
	
		//e
	LCD_DrawFullRect(x+70, y-150, 30, 10);
	LCD_DrawFullRect(x+70, y-150, 10, 60);
	LCD_DrawFullRect(x+90, y-150, 20, 10);
	LCD_DrawFullRect(x+120, y-150, 30, 10);
	
	//p
	LCD_DrawFullRect(x+70, y-190, 30, 10);
	LCD_DrawFullRect(x+70, y-190, 10, 60);
	LCD_DrawFullRect(x+70, y-210, 10, 40);
	LCD_DrawFullRect(x+100, y-190, 30, 10);
	
		//e
	LCD_DrawFullRect(x+70, y-230, 30, 10);
	LCD_DrawFullRect(x+70, y-230, 10, 60);
	LCD_DrawFullRect(x+90, y-230, 20, 10);
	LCD_DrawFullRect(x+120, y-230, 30, 10);
	
	//r
	LCD_DrawFullRect(x+70, y-270, 30, 10);
	LCD_DrawFullRect(x+70, y-270, 10, 60);
	LCD_DrawFullRect(x+70, y-290, 10, 40);
	LCD_DrawFullRect(x+100, y-270, 30, 10);
	LCD_DrawFullRect(x+110, y-280, 10, 10);
	LCD_DrawFullRect(x+120, y-290, 10, 10);
	DrawBomb(0,8);
	DrawBomb(0,7);
	DrawBomb(0,6);
	DrawBomb(0,5);
	DrawBomb(0,4);
	DrawBomb(0,3);
	DrawBomb(0,2);
	DrawBomb(0,1);
	DrawBomb(4,8);
	DrawBomb(4,7);
	DrawBomb(4,6);
	DrawBomb(4,5);
	DrawBomb(4,4);
	DrawBomb(4,3);
	DrawBomb(4,2);
	DrawBomb(4,1);
}



/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
